EDT/УТ/src/Catalogs/зпКатегорииЗаказов/зпКатегорииЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпКатегорииЗаказов</name>
  <owners>Catalog.зпСхемыКатегорийЗаказов</owners>
  <attributes>
    <name>УровеньОбслуживания</name>
    <type>
      <types>EnumRef.УровниОбслуживания</types>
    </type>
  </attributes>
  <attributes>
    <name>КатегорияДоставкиДляАналитики</name>
    <type>
      <types>EnumRef.зпКлассификаторКатегорийДоставки</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ПоказателиКатегории</name>
    <attributes>
      <name>ВидПоказателя</name>
      <type>
        <types>EnumRef.зпВидыПоказателейКатегорийЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>Значение1</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Значение2</name>
      <type>
        <types>String</types>
        <types>Number</types>
        <numberQualifiers>
          <precision>15</precision>
          <scale>3</scale>
        </numberQualifiers>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Enums/зпВидыПоказателейКатегорийЗаказов/зпВидыПоказателейКатегорийЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>зпВидыПоказателейКатегорийЗаказов</name>
  <enumValues>
    <name>ВесЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ОбъемЗаказа</name>
  </enumValues>
  <enumValues>
    <name>ЗначениеРеквизитаЗаказа</name>
  </enumValues>
</mdclass:Enum>

EDT/УТ/src/Catalogs/зпСхемыКатегорийЗаказов/зпСхемыКатегорийЗаказов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>зпСхемыКатегорийЗаказов</name>
  <attributes>
    <name>Регион</name>
    <type>
      <types>CatalogRef.РегиональныеТерминалы</types>
    </type>
  </attributes>
  <attributes>
    <name>ТипЗаказа</name>
    <type>
      <types>EnumRef.ТипыЗаказов</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ВидыПоказателейКатегорийЗаказов</name>
    <attributes>
      <name>ВидПоказателяКатегорийЗаказов</name>
      <type>
        <types>EnumRef.зпВидыПоказателейКатегорийЗаказов</types>
      </type>
    </attributes>
    <attributes>
      <name>ВидПоказателяДоступен</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>30</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

EDT/УТ/src/Catalogs/зпКатегорииЗаказов/Forms/РедактированиеКатегорииЗаказов/Module.bsl
&НаКлиенте
Перем этоНовый;

&НаКлиенте
Процедура ПослеЗаписи(ПараметрыЗаписи)
	
	Если этоНовый Тогда
		ОповеститьОВыборе(Объект.Ссылка);
	Конецесли;

КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	этоНовый = Параметры.Ключ.Пустая();
	СписокДоступныхПоказателей();
	
КонецПроцедуры

&НаСервере
Функция СписокДоступныхПоказателей()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	зпСхемыКатегорийЗаказовВидыПоказателейКатегорийЗаказов.ВидПоказателяКатегорийЗаказов КАК ВидПоказателяКатегорийЗаказов
		|ИЗ
		|	Справочник.зпСхемыКатегорийЗаказов.ВидыПоказателейКатегорийЗаказов КАК зпСхемыКатегорийЗаказовВидыПоказателейКатегорийЗаказов
		|ГДЕ
		|	зпСхемыКатегорийЗаказовВидыПоказателейКатегорийЗаказов.Ссылка = &Ссылка
		|	И зпСхемыКатегорийЗаказовВидыПоказателейКатегорийЗаказов.ВидПоказателяДоступен";
		//|	И НЕ зпСхемыКатегорийЗаказовВидыПоказателейКатегорийЗаказов.ВидПоказателяКатегорийЗаказов В (&ПоказателиУжеДобавленныеВКатегорию)";
	
	Запрос.УстановитьПараметр("Ссылка", Объект.Владелец);
	//Запрос.УстановитьПараметр("ПоказателиУжеДобавленныеВКатегорию", Объект.ПоказателиКатегории.Выгрузить(,"ВидПоказателя"));
	
	ТаблДоступныхПоказателей = Запрос.Выполнить().Выгрузить();
	Для Каждого показатель Из ТаблДоступныхПоказателей Цикл
		Элементы.ПоказателиКатегорииВидПоказателя.СписокВыбора.Добавить(показатель.ВидПоказателяКатегорийЗаказов);
	КонецЦикла;
	
КонецФункции

&НаКлиенте
Процедура ПоказателиКатегорииВидПоказателяОбработкаВыбора(Элемент, ВыбранноеЗначение, СтандартнаяОбработка)
	
	ПараметрыОтбора = Новый Структура("ВидПоказателя", ВыбранноеЗначение);
	строкаТЧ = Объект.ПоказателиКатегории.НайтиСтроки(ПараметрыОтбора);
	Если строкаТЧ.Количество() > 0 Тогда
		
		СтандартнаяОбработка = Ложь;
		
	Иначе	
		
		Если ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.зпВидыПоказателейКатегорийЗаказов.ВесЗаказа") ИЛИ 
			ВыбранноеЗначение = ПредопределенноеЗначение("Перечисление.зпВидыПоказателейКатегорийЗаказов.ОбъемЗаказа") Тогда 
			
			Элементы.ПоказателиКатегории.ТекущиеДанные.Значение1 = 0;
			Элементы.ПоказателиКатегории.ТекущиеДанные.Значение2 = 0;
			
		КонецЕсли;	
			
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Процедура ПередЗаписьюНаСервере(Отказ, ТекущийОбъект, ПараметрыЗаписи)
	
	Для Каждого СтрокаПоказателя Из Объект.ПоказателиКатегории Цикл
		ТипЗначения1 = ТипЗнч(СтрокаПоказателя.Значение1);
		ТипЗначения2 = ТипЗнч(СтрокаПоказателя.Значение2);
		Если ТипЗначения1 <> ТипЗначения2 Тогда
			Отказ = Истина;
			Сообщить("Типы значений в строке " + СтрокаПоказателя.НомерСтроки +  " не совпадают: Значение1 - " + ТипЗначения1 + ", Значение2 - " + ТипЗначения2);
		КонецЕсли
	КонецЦикла;
	
КонецПроцедуры
